#Задача: Створіть дві змінні first=10, second=30. Виведіть на екран результат математичної взаємодії (+, -, *, / и тд.) для цих чисел.

first = 10
second = 30

result = first + second
print(result)

result = first - second
print(result)

result = first * second
print(result)

result = first / second
print(result)

result = first // second
print(result)

result = first ** second
print(result)

result = first % second
print(result)