#Задача: Створіть змінну и по черзі запишіть в неї результат порівняння (<, > , ==, !=) чисел з завдання 1. Виведіть на екран результат кожного порівняння.

my_bool = True
my_bool = False

result = 10 < 30
print(result)

result = 10 > 30
print(result)

result = 10 == 30
print(result)

result = 10 != 30
print(result)